file_name_input = "smart_ivanovo.xlsx"
file_name_input_2 = "sv_k.xlsx"
file_name_input_3 = "sv_e.xlsx"
file_name_result = "smart_ivanovo_result.xlsx"

d = ['0D1-035', 'Семечки "Джинн"35г.(100)', 100,
     '0D1-070', 'Семечки "Джинн"70г.(50)', 50,
     '0D1-140', 'Семечки "Джинн"(10%)140г.(25)', 25,
     '0D1-250', 'Семечки "Джинн"250г.(14)', 14,
     '0D1-350', 'Семечки "Джинн"350г.(10)', 10]
d_s = ['0D2-035', 'Семечки "Джинн"(соленые)35г.(100)', 100,
       '0D2-070', 'Семечки "Джинн"(соленые)70г.(50)', 50,
       '0D2-140', 'Семечки "Джинн"(соленые)(10%)140г.(25)', 25,
       '0D2-250', 'Семечки "Джинн"(соленые)250г.(14)', 14,
       '0D2-350', 'Семечки "Джинн"(соленые)350г.(10)', 10]
v = ['0V1-050', 'Семечки "Солнечный Великан"Джинн"50г.(60)', 60,
     '0V1-100', 'Семечки "Солнечный Великан"Джинн"100г.(30)', 30,
     '0V1-120', 'Семечки "Солнечный Великан"Джинн"120г.(25)', 25,
     '0V1-200', 'Семечки "Солнечный Великан"Джинн"200г.(15)', 15]
v_s = ['0V2-050', 'Семечки "Солнечный Великан"Джинн"(соленые)50г.(60)', 60,
       '0V2-100', 'Семечки "Солнечный Великан"Джинн"(соленые)100г.(30', 30,
       '0V2-120', 'Семечки "Солнечный Великан"Джинн"(соленые)120г.(25', 25,
       '0V2-200', 'Семечки "Солнечный Великан"Джинн"(соленые)200г.(15', 15,
       '0V2-300', 'Семечки "Солнечный Великан"Джинн"(соленые)300г.(10', 10]
v_o_s = ['0V3-100', 'Семечки "Солнечный Великан"Джинн"(особо сол100г(30', 30]
m = ['0M1-070', 'Семечки "Мастер Жарки"70г.(50)', 50,
     '0M1-140', 'Семечки "Мастер Жарки"140г.(25)', 25,
     '0M1-250', 'Семечки "Мастер Жарки"250г.(14)', 14,
     '0M1-350', 'Семечки "Мастер Жарки"350г.(10)', 10]
k = ['0K2-050', 'Арахис "Караван орехов"50г.(40)', 40,
     '0K2-090', 'Арахис "Караван орехов"90г.(22)', 22,
     '0K2-150', 'Арахис "Караван орехов"150г.(20)', 13.3,
     '0K2-500', 'Арахис "Караван орехов"500г.(50)', 4]
k_s = ['0S2-040', 'Арахис "Караван орехов"Стандарт"40г.(50)', 50,
       '0S2-090', 'Арахис "Караван орехов"Стандарт"90г.(22)', 22]
t = ['0T2-050', 'Семечки тыквы "Джинн"(соленые)50г.(70)', 70,
     '0T2-100', 'Семечки тыквы "Джинн"(соленые)100г.(35)', 35]

#Dolgacheva = ['ПВЗ Шуя 1', 'ПВЗ Шуя 2', 'ПВЗ Родники 1']  ##Долгачева Ирина (ЭК СМАРТ
Drozdova = ['ПВЗ Шуя 1', 'ПВЗ Шуя 2', 'ПВЗ Родники 1', 'ПВЗ Вичуга 1']  ##Дроздова Марина (ЭК СМАРТ
# добавлено ['ПВЗ Шуя 1', 'ПВЗ Шуя 2', 'ПВЗ Родники 1']
Korsakova = ['ПВЗ Воскресенское 1', 'ПВЗ Новые горки 1', 'ПВЗ Лежнево 1', 'ПВЗ Лежнево 2', 'ПВЗ Шилыково 1']  ##Корсакова Елена (ЭК СМАРТ
Krasnova = ['ПВЗ Жуково 1', 'ПВЗ Иваново Благова', 'ПВЗ Иваново Дружба']  ##Краснова Наталья (ЭК СМАР
Shutova = ['ПВЗ Васильевское 1', 'ПВЗ Воскресенское 2', 'ПВЗ Колобово 1', 'ПВЗ Михалково 1', 'ПВЗ Палех 1',
           'ПВЗ Савино 1', 'ПВЗ Центральный 1']  ##Шутова Ольга (ЭК СМАРТ)
Migushova = ['ПВЗ Иваново Академическая', 'ПВЗ Иваново Демидова', 'ПВЗ Иваново Бубнова', 'ПВЗ Иваново Сакко',
             'ПВЗ Иваново Самойлова', 'ПВЗ Суворова', 'ПВЗ Иваново 9 Января', 'ПВЗ Иваново Победы',
             'ПВЗ Иваново Слесарный', 'ПВЗ Иваново Афанасьева']  ##Мигушова Надежда (ЭК СМАР
Fedotova = ['ПВЗ Михалево 1', 'ПВЗ НовоТалицы 2', 'ПВЗ НовоТалицы 3', 'ПВЗ Тейково 2', 'ПВЗ Чернореченский 1',
            'ПВЗ Чернореченский 2']  ##Федотова Анна (ЭК СМАРТ)
Chepa = ['ПВЗ Авдотьино 1', 'ПВЗ Авдотьино 2', 'ПВЗ Иваново Гарнизон', 'ПВЗ Иваново Дюковская', 'ПВЗ Иваново Н.Неман',
         'ПВЗ Приволжск 1', 'ПВЗ Приволжск 2', 'ПВЗ Приволжск 3']  ##Чепа Елена (ЭК СМАРТ)
Ogurova = ['ПВЗ Заволжск 1', 'ПВЗ Наволоки 1', 'ПВЗ Кинешма 1', 'ПВЗ Кинешма 2', 'ПВЗ Кинешма 3']##Огурова Ольга (ЭК СМАРТ)
# добавлено 'ПВЗ Наволоки 1', 'ПВЗ Кинешма 1', 'ПВЗ Кинешма 2'

tp_1c = ['Дроздова Марина (ЭК СМАРТ', 'Корсакова Елена (ЭК СМАРТ',
         'Огурова Ольга (ЭК СМАРТ)', 'Федотова Анна (ЭК СМАРТ)', 'Краснова Наталья (ЭК СМАР',
         'Мигушова Надежда (ЭК СМАР', 'Чепа Елена (ЭК СМАРТ)', 'Шутова Ольга (ЭК СМАРТ)'] #убрана Долгачева
tp = ['Дроздова Марина', 'Корсакова Елена', 'Огурова Ольга', 'Федотова Анна',
      'Краснова Наталья', 'Мигушова Надежда', 'Чепа Елена', 'Шутова Ольга'] #убрана Долгачева

#Количества товаров в группах отчета СВ и общая их сумма
number_of_products_in_group_1 = 5
number_of_products_in_group_2 = 2
number_of_products_in_group_3 = 3
number_of_products = number_of_products_in_group_1 + number_of_products_in_group_2 + number_of_products_in_group_3

row_with_itogo = 12